:PROPERTIES:
:ID: 911100ed-309c-48a8-bc69-a81336f04e68
:END:
#+title: Add
#+description: Add
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-05-21

Add a new country.

#+name: countries-add
#+begin_src ores-shell :exports none
countries add XY XYZ 1234 Xyzland "Xyzland land" "system.new" "New country"
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<countries-add>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Country added successfully!
ores-shell> Bye!
#+end_example
